KimTeddy/2601_TMS320F28388D_TEST/260109_PWM/260109_1100_Driverlib Empty CPU1 Example CCS Project/empty_driverlib_main.c
//#############################################################################
//
// FILE:   empty_driverlib_main.c
//
//! \addtogroup driver_example_list
//! <h1>Empty Project Example</h1> 
//!
//! This example is an empty project setup for Driverlib development.
//!
//
//#############################################################################
//
//
// 
// C2000Ware v6.00.01.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################

//
// Included Files
//
#include "driverlib.h"
#include "device.h"
#include "board.h"
#include "c2000ware_libraries.h"
static inline void EPWM1_setDuty(float duty)
{
    if(duty < 0.001f) duty = 0.001f;     // 0%/100% 극단값은 글리치 방지용으로 살짝 클램프
    if(duty > 0.999f) duty = 0.999f;

    uint16_t tbprd = EPWM_getTimeBasePeriod(EPWM1_U_BASE);
    uint16_t cmpa  = (uint16_t)((float)tbprd * duty);

    EPWM_setCounterCompareValue(EPWM1_U_BASE, EPWM_COUNTER_COMPARE_A, cmpa);
}
static inline void EPWM2_setDuty(float duty)
{
    if(duty < 0.001f) duty = 0.001f;     // 0%/100% 극단값은 글리치 방지용으로 살짝 클램프
    if(duty > 0.999f) duty = 0.999f;

    uint16_t tbprd = EPWM_getTimeBasePeriod(EPWM2_V_BASE);
    uint16_t cmpa  = (uint16_t)((float)tbprd * duty);

    EPWM_setCounterCompareValue(EPWM2_V_BASE, EPWM_COUNTER_COMPARE_A, cmpa);
}
//
// Main
//
void main(void)
{

    //
    // Initialize device clock and peripherals
    //
    Device_init();

    //
    // Disable pin locks and enable internal pull-ups.
    //
    Device_initGPIO();

    //
    // Initialize PIE and clear PIE registers. Disables CPU interrupts.
    //
    Interrupt_initModule();

    //
    // Initialize the PIE vector table with pointers to the shell Interrupt
    // Service Routines (ISR).
    //
    Interrupt_initVectorTable();

    //
    // PinMux and Peripheral Initialization
    //
    Board_init();

    //
    // C2000Ware Library initialization
    //
    C2000Ware_libraries_init();

    GPIO_writePin(DEVICE_GPIO_PIN_LED1, 1U);
    GPIO_writePin(DEVICE_GPIO_PIN_LED2, 1U);
    GPIO_writePin(DEVICE_GPIO_PIN_LED3, 1U);
    GPIO_writePin(DEVICE_GPIO_PIN_LED4, 0U);
    //
    // Enable Global Interrupt (INTM) and real time interrupt (DBGM)
    //
    EINT;
    ERTM;

    while(1)
    {
        GPIO_togglePin(DEVICE_GPIO_PIN_LED4);
        GPIO_togglePin(DEVICE_GPIO_PIN_LED1);
        EPWM1_setDuty(0.5);
        EPWM2_setDuty(0.99);
        DEVICE_DELAY_US(500000);   // 500 ms
        GPIO_togglePin(DEVICE_GPIO_PIN_LED1);
        GPIO_togglePin(DEVICE_GPIO_PIN_LED2);
        DEVICE_DELAY_US(500000);   // 500 ms
        GPIO_togglePin(DEVICE_GPIO_PIN_LED2);
        GPIO_togglePin(DEVICE_GPIO_PIN_LED3);
        EPWM1_setDuty(0.9);
        EPWM2_setDuty(0.2);
        DEVICE_DELAY_US(500000);   // 500 ms
        GPIO_togglePin(DEVICE_GPIO_PIN_LED3);
        GPIO_togglePin(DEVICE_GPIO_PIN_LED4);
        DEVICE_DELAY_US(500000);   // 500 ms
    }
}

//
// End of File
//
